Nazli
Uzgur
Education
May
Bachelor
Science
Computer
Carnegie
Mellon
University
Pittsburgh
Relevant
Coursework
Great
Theoretical
Ideas
Principles
Functional
Programming
Introduction
Systems
Fundamentals
Imperative
Computation
Concepts
Mathematics
Game
Design
Minor
Skills
Languages
Limited
Proficieny
Python
Java
SML
Spoken
Fluent
Turkish
English
Conversational
Proficiency
Japanese
Experience
NLP
Been
working
Natural
Language
Processing
program
January
Mecidiyekoy
EnglishTurkish
translator
company
June
Karate
Cofounder
president
team
Oct
Anime
Manga
President
club
PR
Public
relations
tour
guide
Robert
College
Interests
Buggy
Driving
small
vehicle
created
CMU
students
competing
Learning
Dancing
Latin
contemporary
jazz
dance
years
Skiing
competed
races
Volunteering
Peer
tutor
introduced
new
cultures
children
movie
theaters
helped
international
orientation
registering
Selale
Evleri
Duden
Bahcesehir
Istanbul
Turkey
nazliuzgurgmailcom
EMILIA
RENZI
erenzismithedu
Smith
Chapin
Way
Unit
Northampton
MA
EDUCATION
BA
degree
expected
Intended
Major
Sociology
Vanguard
High
School
Ocala
FL
Graduated
Honors
National
Honor
Society
inducted
junior
Roll
Spanish
MS
Word
Excel
PowerPoint
LEADERSHIP
EXPERIENCE
Assistant
Coach
Marion
County
Youth
Softball
League
Summers
Coplanned
led
twiceweekly
practice
sessions
girls
ages
including
beginner
players
Designed
focus
selfesteem
motivation
teamwork
skills
Supervised
head
vacations
debriefed
daily
progress
parents
Member
Anchor
Service
Club
Participated
teambased
volunteer
projects
supported
sponsored
families
holiday
time
Assisted
several
town
events
wrapping
presents
mall
needy
Projects
received
awards
Association
Clubs
Conducted
meetings
members
supervised
coordinators
subcommittees
Organized
activities
fundraisers
candy
sale
food
toy
drive
Helped
plan
implement
schoolwide
Mardi
Gras
attended
Collaborated
faculty
advisor
Active
member
election
Arts
Leader
Fine
Kids
Miami
Led
arts
crafts
costfree
field
trips
using
items
local
recycling
center
initiated
art
show
campers
Discussed
guardians
dropoff
pickup
times
Maintained
replenished
materials
kept
area
clean
safe
Other
Activities
Fastpitch
Varsity
Team
Shocker
Park
AllStar
Travel
Slowpitch
JV
Soccer
Symphony
Under
Stars
Volunteer
ADDITIONAL
Waitress
Restaurant
Provided
attentive
customer
service
lunch
dinner
shifts
Covered
tables
totaling
customers
Coordinated
birthday
parties
Served
dining
room
hostess
handling
highvolume
ice
cream
walkup
window
Praised
manager
skillful
challenging